//#define _CRT_SECURE_NO_WARNINGS 1
////以下程序输出什么
//#include<stdio.h>
//int main()
//{
//	char a = -1;
//	//补码:11111111111111111111111111111111
//	//当我们要把-1的二进制序列存放到a中去，a只能存放8个比特位
//	//故a中存放的是11111111
//	//a整型提示后:11111111111111111111111111111111
//	signed char b = -1;
//	//补码:11111111111111111111111111111111
//	//当我们要把-1的二进制序列存放到b中去，b也只能存放8个比特位
//	//故b中存放的是11111111
//	//b整型提示后:11111111111111111111111111111111
//	unsigned char c = -1;
//	//c中存放的是11111111
//	//c整型提示后:11111111111111111111111111111111
//	//虽然a、b、c中存放的内容都是11111111，但是当我们再把它们拿出来的时候就不一样了。
//	//如果要把a、b、c的整型打印出来，那我们就需要计算出a、b、c的整型形式，
//	//所以就需要对a、b、c进行整型提升(整型提升按照原符号进行提升，无符号数进行整型提升时补0)
//	printf("a=%d,b=%d,c=%d\n", a, b, c);
//	//-1  -1  255
//	return 0;
//}

////以下程序输出什么
//#include<stdio.h>
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000---原码
//	//11111111111111111111111101111111---反码
//	//10000000000000000000000010000000---补码
//	//10000000
//	//由于要打印无符号十进制数字，故需要对10000000进行整型提升
//	//整型提升之后:11111111111111111111111110000000---这依然是补码
//	//按照正常道理我们需要把补码转换为原码来获得最终的结果，但注意这里是%u，即按照无符号数来进行打印
//	//所以说计算机认为内存中存放的是一个无符号数，既然是这样的或，原、反、补码是相同的
//	//所以直接把11111111111111111111111110000000拿出来充当我们的原码
//	//最终结果为:4294967168
//	printf("%u\n", a);//%u是打印十进制的无符号数字
//	return 0;
//}


////以下输出结果是什么
//#include<stdio.h>
//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//	return 0;
//}


////以下输出结果是什么
//#include<stdio.h>
//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	//可以按照补码的形式进行运算，最后格式化成整数
//	//10000000 00000000 00000000 00010100
//	//11111111 11111111 11111111 11101011
//	//11111111 11111111 11111111 11101100-补码
//	//11111111 11111111 11111111 11110110-补码
//	//11111111 11111111 11111111 11110110-结果补码
//	//11111111 11111111 11111111 11110101-结果反码
//	//10000000 00000000 00000000 00001010-结果原码
//	//最终结果为-10
//	return 0;
//}

//以下输出结果是什么
//#include<stdio.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}


//以下输出结果是什么
//#include<stdio.h>
//#include<string.h>
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", strlen(a));
//	return 0;
//}

////以下输出结果是什么
//#include<stdio.h>
//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}













































































