//#define _CRT_SECURE_NO_WARNINGS 1
//#include<stdio.h>
//int main()
//{
//	int n = 9;
//	//0 00000000 00000000000000000001001-补码
//	float* pFloat = (float*)&n;
//	printf("n的值为:%d\n", n);//9
//	printf("*pFloat的值为:%f\n", *pFloat);//0.000000
//	//(-1)^0 * 0.00000000000000000001001 * 2^(-126)
//
//	*pFloat = 9.0;
//	//1001.0
//	//1.001*2^3
//	//(-1)^0 * 1.001 * 2^3   这里E为3，存的时候要加上127变为130，即10000010
//	//0  10000010  00100000000000000000000这就是9.0存的内存的形式
//
//	printf("num的值为:%d\n", n);//这个时候要打印n的话，
//	//既然要打印n(n是一个整数)就要站在n的角度，认为内存中存的是一个整数的补码，
//	//即01000001000100000000000000000000，这也是这个整数的原码
//	//01000001000100000000000000000000转换为十进制为1091567616
//	printf("*pFloat的值为%f\n", *pFloat);//9.0
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1
//	//(-1)^0 * 1.011 * 2^2
//	//S = 0
//	//M = 1.011
//	//E = 2
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40b00000
//	//即指数E的计算值减去127
//	return 0;
//}




































































































